export default {
    '/技术分享/技术总结/':[{
      text:'技术总结',
      items:[
        {text:'常见的Linux命令',link:'/技术分享/技术总结/常见的Linux命令'},
        {text:'前端代码简洁之道',link:'/技术分享/技术总结/前端代码简洁之道'},
        {text:'前端优化策略',link:'/技术分享/技术总结/前端优化策略'},
        {text:'浅谈前端处理跨域的几种方法',link:'/技术分享/技术总结/浅谈前端处理跨域的几种方法'},
        {text:'输入URL后发生了些什么',link:'/技术分享/技术总结/输入URL后发生了些什么'},
        {text:'特殊节日界面灰白色样式处理',link:'/技术分享/技术总结/特殊节日界面灰白色样式处理'},
        {text:'VUE同步和异步请求',link:'/技术分享/技术总结/VUE同步和异步请求'}, 
        {text:'Canvas的三个应用',link:'/技术分享/技术总结/Canvas的三个应用'}, 
        {text:'总结ES的一些写法',link:'/技术分享/技术总结/总结ES的一些写法'}, 
        {text:'lodash工具函数',link:'/技术分享/技术总结/lodash工具函数'}, 
        {text:'贝塞尔曲线实现动画样式',link:'/技术分享/技术总结/贝塞尔曲线实现动画样式'}, 
      ]
    }],
    '/技术分享/疑难困惑/':[{
      text:'疑难困惑',
      items:[
        {text:'[el-cascader] 连级选择器标签自定义',link:'/技术分享/疑难困惑/[el-cascader] 连级选择器标签自定义'},
        {text:'[Git] LF和CRLF的兼容问题',link:'/技术分享/疑难困惑/Git-LF和CRLF的兼容问题'},
        {text:'markdown-examples',link:'/技术分享/疑难困惑/markdown-examples'},
        {text:'api-examples',link:'/技术分享/疑难困惑/api-examples'},
      ]
    }],
    '/生活分享/日常随笔/':[{
      text:'日常随笔',
      items: [
        {text:'2020年4月的一些小事',link:'/生活分享/日常随笔/2020年4月的一些小事'},
        {text:'2020年5月的一些小事',link:'/生活分享/日常随笔/2020年5月的一些小事'},
        {text:'2020年度歌手小谈',link:'/生活分享/日常随笔/2020年度歌手小谈'},
        {text:'坐下来谈谈2020',link:'/生活分享/日常随笔/坐下来谈谈2020'},
        {text:'偶遇2020的几个瞬间',link:'/生活分享/日常随笔/偶遇2020的几个瞬间'},
        {text:'2021年1月的一些小事',link:'/生活分享/日常随笔/2021年1月的一些小事'},
        {text:'24岁创作词-致自己',link:'/生活分享/日常随笔/24岁创作词-致自己'},
        {text:'致父亲',link:'/生活分享/日常随笔/致父亲'},
        {text:'半夜未眠我在想什么',link:'/生活分享/日常随笔/半夜未眠我在想什么'},
        {text:'随机歌单听到一些老歌',link:'/生活分享/日常随笔/随机歌单听到一些老歌'},
        {text:'2024年6月的一些小事',link:'/生活分享/日常随笔/2024年6月的一些小事'},
        {text:'一些醍醐灌顶的力量',link:'/生活分享/日常随笔/一些醍醐灌顶的力量'},
      ]
    }],
    '/生活分享/旅行日记/':[{
      text:'旅行日记',
      items: [
        {text:'出差青岛',link:'/生活分享/旅行日记/出差青岛'},
        {text:'11',link:'/生活分享/旅行日记/index'},
      ]
    }],
    '/生活分享/育儿分享/':[{
      text:'育儿分享',
      items: [
        {text:'11',link:'/生活分享/育儿分享/index'},
        {text:'一岁',link:'/生活分享/育儿分享/一岁'},
      ]
    }],
    // 观读感受模块
    '/观读感受/观海听涛/':[{
      text:'观海听涛',
      items: [
        {text:'鱿鱼游戏',link:'/观读感受/观海听涛/鱿鱼游戏'},
      ]
    }],
    '/观读感受/书读万卷/':[{
      text:'书读万卷',
      items: [
      ]
    }]
  }
